NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_flpr.svd
            <register>
              <name>DMATDLR</name>
              <description>DMA Transmit Data Level</description>
              <addressOffset>0x050</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMATDL</name>
                  <description>Transmit Data Level. This bit field controls the level at which a DMA request is made by the transmit logic. It is equal to the watermark level; that is, the dma_tx_req signal is generated when the number of valid data entries in the transmit FIFO is equal to or below this field value, and TDMAE = 1.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDDMATDLR</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>DMARDLR</name>
              <description>DMA Receive Data Level</description>
              <addressOffset>0x054</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DMARDL</name>
                  <description>Receive Data Level. This bit field controls the level at which a DMA request is made by the receive logic. The watermark level = DMARDL+1; that is, dma_rx_req is generated when the number of valid data entries in the receive FIFO is equal to or above this field value + 1, and RDMAE=1.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDDMARDLR</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>IDR</name>
              <description>Identification Register</description>
              <addressOffset>0x058</addressOffset>
              <access>read-write</access>
              <resetValue>0x51535049</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>IDCODE</name>
                  <description>Identification code. The register contains the identification code of the peripheral, which is written into the register at configuration time using CoreConsultant.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SSICVERSIONID</name>
              <description>MSPI CORE component version</description>
              <addressOffset>0x05C</addressOffset>
              <access>read-write</access>
              <resetValue>0x3230312A</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SSICCOMPVERSION</name>
                  <description>Contains the hex representation of the Synopsys component version. Consists of ASCII value for each number in the version, followed by *. For example 31_30_33_2A represents the version 1.03*.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <dim>0x24</dim>
              <dimIncrement>0x4</dimIncrement>
              <name>DR[%s]</name>
              <description>Description collection: MSPI CORE Data Register 0</description>
              <addressOffset>0x060</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DR</name>
                  <description>Data Register. When writing to this register, you must right-justify the data. Read data are automatically right-justified.</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>RXSAMPLEDELAY</name>
              <description>RX Sample Delay Register</description>
              <addressOffset>0x0F0</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RSD</name>
                  <description>Receive Data (rxd) Sample Delay. This register is used to delay the sample of the rxd input port. Each value</description>
                  <lsb>0</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>RSVD0RXSAMPLEDELAY</name>
                  <lsb>8</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SE</name>
                  <description>Receive Data (rxd) Sampling Edge. This register is used to decide the sampling edge for RXD signal with ssi_clk. Then this bit is set to 1 then negative edge of ssi_clk will be used to sample the incoming data, otherwise positive edge will be used for sampling.</description>
                  <lsb>16</lsb>
                  <msb>16</msb>
                </field>
                <field>
                  <name>RSVD1RXSAMPLEDELAY</name>
                  <lsb>17</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SPICTRLR0</name>
              <description>SPI_CTRLR0 - SPI Control Register</description>
              <addressOffset>0x0F4</addressOffset>
              <access>read-write</access>
              <resetValue>0x40000200</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Instruction and Address will be sent in Standard SPI Mode.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Instruction will be sent in Standard SPI Mode and Address will be sent in the mode specified by CTRLR0.SPI_FRF.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Both Instruction and Address will be sent in the mode specified by SPI_FRF.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Dual Octal mode, the address and instruction are transferred in octal mode and data is transferred on 16 data lines.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ADDRL</name>
                  <description>This bit defines Length of Address to be transmitted. Only after this much bits are programmed in to the FIFO the transfer can begin.</description>
                  <lsb>2</lsb>
                  <msb>5</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDR_L0</name>
                      <description>No Address</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L4</name>
                      <description>4 bit Address length</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L8</name>
                      <description>8 bit Address length</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L12</name>
                      <description>12 bit Address length</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L16</name>
                      <description>16 bit Address length</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L20</name>
                      <description>20 bit Address length</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L24</name>
                      <description>24 bit Address length</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L28</name>
                      <description>28 bit Address length</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L32</name>
                      <description>32 bit Address length</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L36</name>
                      <description>36 bit Address length</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L40</name>
                      <description>40 bit Address length</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L44</name>
                      <description>44 bit Address length</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L48</name>
                      <description>48 bit Address length</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L52</name>
                      <description>52 bit Address length</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L56</name>
                      <description>56 bit Address length</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L60</name>
                      <description>60 bit Address length</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSPICTRLR06</name>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR07</name>
                  <lsb>7</lsb>
                  <msb>7</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>INSTL</name>
                  <description>Enhanced SPI mode instruction length in bits.</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INST_L0</name>
                      <description>No Instruction</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L4</name>
                      <description>4 bit Instruction length</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L8</name>
                      <description>8 bit Instruction length</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L16</name>
                      <description>16 bit Instruction length</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSPICTRLR010</name>
                  <lsb>10</lsb>
                  <msb>10</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>WAITCYCLES</name>
                  <description>Wait cycles in SPI mode between control frames transmit and data transmit/reception. Specified as number of SPI clock cycles.</description>
                  <lsb>11</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR016</name>
                  <lsb>16</lsb>
                  <msb>16</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR017</name>
                  <lsb>17</lsb>
                  <msb>17</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR018</name>
                  <lsb>18</lsb>
                  <msb>18</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR019</name>
                  <lsb>19</lsb>
                  <msb>19</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR020</name>
                  <lsb>20</lsb>
                  <msb>20</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR021</name>
                  <lsb>21</lsb>
                  <msb>21</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR022</name>
                  <lsb>22</lsb>
                  <msb>22</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR023</name>
                  <lsb>23</lsb>
                  <msb>23</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR024</name>
                  <lsb>24</lsb>
                  <msb>24</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR025</name>
                  <lsb>25</lsb>
                  <msb>25</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR02627</name>
                  <lsb>26</lsb>
                  <msb>27</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR028</name>
                  <lsb>28</lsb>
                  <msb>28</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPICTRLR029</name>
                  <lsb>29</lsb>
                  <msb>29</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CLKSTRETCHEN</name>
                  <description>Enables clock stretching capability in SPI transfers.</description>
                  <lsb>30</lsb>
                  <msb>30</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR0</name>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SPICTRLR1</name>
              <description>SPI Control 1 register</description>
              <addressOffset>0x118</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DYNWS</name>
                  <description>SPI Dynamic Wait states field.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR134</name>
                  <lsb>3</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>MAXWS</name>
                  <description>Maximum wait cycles allowed per transaction.</description>
                  <lsb>5</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR1</name>
                  <lsb>9</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CSMINHIGH</name>
                  <description>Chip-Select Minimum HIGH period.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>RSVDSPICTRLR12031</name>
                  <lsb>20</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SPITECR</name>
              <description>SPI Transmit Error Interrupt Clear Register</description>
              <addressOffset>0x11C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SPITECR</name>
                  <description>Clear SPI Transmit Error interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDSPITECR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
