NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_flpr.svd
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER22_NS</name>
      <description>Timer/Counter 8</description>
      <baseAddress>0x400CC000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER22</name>
        <value>204</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER22_S</name>
      <description>Timer/Counter 9</description>
      <baseAddress>0x500CC000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER22</name>
        <value>204</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER23_NS</name>
      <description>Timer/Counter 10</description>
      <baseAddress>0x400CD000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER23</name>
        <value>205</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER23_S</name>
      <description>Timer/Counter 11</description>
      <baseAddress>0x500CD000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER23</name>
        <value>205</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER24_NS</name>
      <description>Timer/Counter 12</description>
      <baseAddress>0x400CE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER24</name>
        <value>206</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TIMER00_NS">
      <name>GLOBAL_TIMER24_S</name>
      <description>Timer/Counter 13</description>
      <baseAddress>0x500CE000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER24</name>
        <value>206</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_MEMCONF_NS</name>
      <description>Memory configuration 0</description>
      <baseAddress>0x400CF000</baseAddress>
      <headerStructName>MEMCONF</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>MEMCONF</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>POWER[%s]</name>
          <description>Unspecified</description>
          <headerStructName>MEMCONF_POWER</headerStructName>
          <access>read-write</access>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>CONTROL</name>
            <description>Description cluster: Control memory block power.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MEM0</name>
                <description>Keep the memory block MEM[0] on or off when in System ON mode.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM1</name>
                <description>Keep the memory block MEM[1] on or off when in System ON mode.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM2</name>
                <description>Keep the memory block MEM[2] on or off when in System ON mode.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM3</name>
                <description>Keep the memory block MEM[3] on or off when in System ON mode.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM4</name>
                <description>Keep the memory block MEM[4] on or off when in System ON mode.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM5</name>
                <description>Keep the memory block MEM[5] on or off when in System ON mode.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM6</name>
                <description>Keep the memory block MEM[6] on or off when in System ON mode.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM7</name>
                <description>Keep the memory block MEM[7] on or off when in System ON mode.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM8</name>
                <description>Keep the memory block MEM[8] on or off when in System ON mode.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM9</name>
                <description>Keep the memory block MEM[9] on or off when in System ON mode.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM10</name>
                <description>Keep the memory block MEM[10] on or off when in System ON mode.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM11</name>
                <description>Keep the memory block MEM[11] on or off when in System ON mode.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM12</name>
                <description>Keep the memory block MEM[12] on or off when in System ON mode.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM13</name>
                <description>Keep the memory block MEM[13] on or off when in System ON mode.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM14</name>
                <description>Keep the memory block MEM[14] on or off when in System ON mode.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM15</name>
                <description>Keep the memory block MEM[15] on or off when in System ON mode.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM16</name>
                <description>Keep the memory block MEM[16] on or off when in System ON mode.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM17</name>
                <description>Keep the memory block MEM[17] on or off when in System ON mode.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM18</name>
                <description>Keep the memory block MEM[18] on or off when in System ON mode.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM19</name>
                <description>Keep the memory block MEM[19] on or off when in System ON mode.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM20</name>
                <description>Keep the memory block MEM[20] on or off when in System ON mode.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM21</name>
                <description>Keep the memory block MEM[21] on or off when in System ON mode.</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM22</name>
                <description>Keep the memory block MEM[22] on or off when in System ON mode.</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM23</name>
                <description>Keep the memory block MEM[23] on or off when in System ON mode.</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM24</name>
                <description>Keep the memory block MEM[24] on or off when in System ON mode.</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM25</name>
                <description>Keep the memory block MEM[25] on or off when in System ON mode.</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM26</name>
                <description>Keep the memory block MEM[26] on or off when in System ON mode.</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>On</name>
                    <description>Power up, retained</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MEM27</name>
                <description>Keep the memory block MEM[27] on or off when in System ON mode.</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Off</name>
                    <description>Power down, not retained</description>
