NordicSemiconductor/nrfx/bsp/stable/mdk/nrf71/nrf7120e_enga/nrf7120e_enga_flpr.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_AUXPM_NS</name>
      <description>AUXPM 0</description>
      <baseAddress>0x40130000</baseAddress>
      <alternatePeripheral>GLOBAL_AUXPLL_NS</alternatePeripheral>
      <headerStructName>AUXPM</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AUXPLL_AUXPM</name>
        <value>304</value>
      </interrupt>
      <groupName>AUXPM</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>UNUSED</name>
          <description>Unused.</description>
          <addressOffset>0x000</addressOffset>
          <resetValue>0x00000000</resetValue>
          <access>read-only</access>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_AUXPLL_NS">
      <name>GLOBAL_AUXPLL_S</name>
      <description>AUXPLL 1</description>
      <baseAddress>0x50130000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>AUXPLL_AUXPM</name>
        <value>304</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_AUXPM_NS">
      <name>GLOBAL_AUXPM_S</name>
      <description>AUXPM 1</description>
      <baseAddress>0x50130000</baseAddress>
      <alternatePeripheral>GLOBAL_AUXPLL_S</alternatePeripheral>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>AUXPLL_AUXPM</name>
        <value>304</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>